Расширение/Расширение/Documents/B1_ГенерацияСерийныхНомеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>B1_ГенерацияСерийныхНомеров</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СерийныйНомера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Не используется. Нужен для работы расширения ДатаМобайл</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Расширение/Расширение/InformationRegisters/СерийныеНомераНаПечать.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СерийныеНомераНаПечать</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Распечатан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДобавленныйСерийныйНомер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.B1_СканированиеНомеровНаСклад</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеИзлишковТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.B1_ГенерацияСерийныхНомеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Расширение/Расширение/Documents/B1_ГенерацияСерийныхНомеров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьДанныеНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерийныеНомераНаПечатьСрезПоследних.СерийныйНомер КАК СерийныйНомер,
		|	1 КАК Количество
		|ИЗ
		|	РегистрСведений.СерийныеНомераНаПечать.СрезПоследних(, ) КАК СерийныеНомераНаПечатьСрезПоследних
		|ГДЕ
		|	СерийныеНомераНаПечатьСрезПоследних.Реализация = &Реализация";
		Запрос.УстановитьПараметр("Реализация", Объект.Ссылка);
		СерийныеНомера.Загрузить(Запрос.Выполнить().Выгрузить());
		ВсегоСерийныхНомеров = СерийныеНомера.Количество();
		
	КонецЕсли;
	
	//Элементы.СтраницаСерийныеНомера.Заголовок = СтрШаблон("Серийные номера (%1)", СтрЗаменить(ВсегоСерийныхНомеров, Символы.НПП, ""));

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	ОбновитьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Buro1Goz_СгенерироватьСерийныеНомераВместо(Команда)
	Buro1Goz_СгенерироватьСерийныеНомераНаСервереВместо();
КонецПроцедуры

&НаСервере
Процедура Buro1Goz_СгенерироватьСерийныеНомераНаСервереВместо()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		Сообщить("Предварительно необходимо записать документ!");
		Возврат;	
	
	КонецЕсли;
	
	ИмяМакета = "";
	
	ЗапросНоменклатурыСканирования = Новый Запрос("
	|ВЫБРАТЬ
	|   НастройкаСобственныхСерийныхНомеров.Префикс КАК Префикс,
	|   НастройкаСобственныхСерийныхНомеров.ОбщаяДлинаКода КАК ОбщаяДлинаКода,
	|   НастройкаСобственныхСерийныхНомеров.ПоследнийНомер КАК ПоследнийНомер,
	|	НастройкаСобственныхСерийныхНомеров.Номенклатура КАК Номенклатура,
	|	НастройкаСобственныхСерийныхНомеров.ИмяМакета КАК ИмяМакета
	|ИЗ
	|	РегистрСведений.НастройкаСобственныхСерийныхНомеров КАК НастройкаСобственныхСерийныхНомеров
	|ГДЕ
	|	НастройкаСобственныхСерийныхНомеров.Номенклатура В (&Номенклатура)");
	
	Если НЕ ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		
		Сообщить("Не указана номенклатура");
		Возврат;
		
	КонецЕсли;	
	
	МассивНом = Новый Массив;
	МассивНом.Добавить(Объект.Номенклатура);
	
	ЗапросНоменклатурыСканирования.УстановитьПараметр("Номенклатура", МассивНом);
	РезультатНоменклатурыСканирования = ЗапросНоменклатурыСканирования.Выполнить().Выгрузить();
	Если РезультатНоменклатурыСканирования.Количество() = 1 Тогда
		
		ИмяМакета = РезультатНоменклатурыСканирования[0].ИмяМакета; 
		
	Иначе	
		
		Сообщить("Не найдена настройка для номенклатуры сканирования: " + Объект.Номенклатура);
		Возврат;
		
	КонецЕсли;

	
	Если НЕ ЗначениеЗаполнено(ИмяМакета) Тогда
		
		Сообщить("Не установлено имя макета!");
		Возврат;	
		
	КонецЕсли;
	
	Если КоличествоГенерируемыхНомеров = 0 Тогда
	
		Сообщить("Укажите количество генерируемых серийных номеров!");
		Возврат;	
	
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Выборка	= РезультатНоменклатурыСканирования[0];	
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.НастройкаСобственныхСерийныхНомеров");
		ЭлементБлокировкиДанных.УстановитьЗначение("Номенклатура", Выборка.Номенклатура);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
						
		ПоследнийНомер = Выборка.ПоследнийНомер;
		
		НоваяЗапись = РегистрыСведений.НастройкаСобственныхСерийныхНомеров.СоздатьМенеджерЗаписи();
		НоваяЗапись.Номенклатура = Выборка.Номенклатура;
		НоваяЗапись.Прочитать();
		НоваяЗапись.ПоследнийНомер = ПоследнийНомер + КоличествоГенерируемыхНомеров;
		НоваяЗапись.Записать();
		
		Для Сч = 1 По КоличествоГенерируемыхНомеров Цикл
			
			ПоследнийНомер = ПоследнийНомер + 1;
			
			ДлинаБезПрефикса = Выборка.ОбщаяДлинаКода - СтрДлина(Выборка.Префикс);
			СформированныйСерийныйНомер = "" + Выборка.Префикс + Формат(ПоследнийНомер, "ЧЦ=" + ДлинаБезПрефикса + "; ЧВН=; ЧГ=0");
			
			ЗаписьПечати = РегистрыСведений.СерийныеНомераНаПечать.СоздатьМенеджерЗаписи();
			
			ЗаписьПечати.Период 		= ТекущаяДата();
			ЗаписьПечати.СерийныйНомер 	= СформированныйСерийныйНомер;
			ЗаписьПечати.Реализация 	= Объект.Ссылка;
			ЗаписьПечати.Количество		= 1;
			ЗаписьПечати.ИмяМакета 		= ИмяМакета;
			
			ЗаписьПечати.Записать();
			
		КонецЦикла; 			
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "" + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщение.Сообщить();
		
	КонецПопытки;
		
	ОбновитьДанныеНаСервере();
	Модифицированность = Истина;

КонецПроцедуры // ()
